Revit 2024 API
WaterLoopData Class
 Represents the data and parameters of analytical water loop.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public class WaterLoopData : IDisposable
Visual Basic
Public Class WaterLoopData _
	Implements IDisposable
Visual C++
public ref class WaterLoopData : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Mechanical.WaterLoopData
See Also
WaterLoopData Members
Autodesk.Revit.DB.Mechanical Namespace